; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v4 ?v8)
             (pred_11 ?v6 ?v5)
             (pred_10 ?v4 ?v5)
             (pred_5 ?v13 ?v4 )
	     (pred_9 ?v4)
             (pred_3 ?v7)
             (pred_6 ?v6)
             (pred_7 ?v5)
             (pred_4 ?v4)
             (pred_2 ?v6)
             (pred_12 ?v4)
             (pred_1 ))



(:action op_4
:parameters (?v9 ?v3 ?v10 ?v1)
:precondition (and (pred_3 ?v9) (pred_3 ?v3) (pred_6 ?v10) (pred_7 ?v1)
          (pred_8 ?v9 ?v3) (pred_11 ?v10 ?v1)
                   (pred_10 ?v3 ?v1) (pred_9 ?v9) 
                   (pred_4 ?v3) (pred_2 ?v10))
:effect (and  (pred_12 ?v3) (not (pred_4 ?v3))))


(:action op_2
:parameters (?v9 ?v12)
:precondition (and (pred_3 ?v9) (pred_3 ?v12)
               (pred_9 ?v9) (pred_8 ?v9 ?v12) (pred_12 ?v12))
:effect (and (pred_9 ?v12) (not (pred_9 ?v9))))

(:action op_3
:parameters (?v9 ?v10)
:precondition (and (pred_3 ?v9) (pred_6 ?v10) 
                  (pred_9 ?v9) (pred_5 ?v10 ?v9) (pred_1 ))
:effect (and (pred_2 ?v10)
   (not (pred_5 ?v10 ?v9)) (not (pred_1 ))))


(:action op_5
:parameters (?v9 ?v2 ?v11)
:precondition (and (pred_3 ?v9) (pred_6 ?v2) (pred_6 ?v11)
                  (pred_9 ?v9) (pred_2 ?v11) (pred_5 ?v2 ?v9))
:effect (and (pred_2 ?v2) (pred_5 ?v11 ?v9)
        (not (pred_2 ?v11)) (not (pred_5 ?v2 ?v9))))

(:action op_1
:parameters (?v9 ?v10)
:precondition (and (pred_3 ?v9) (pred_6 ?v10) 
                  (pred_9 ?v9) (pred_2 ?v10))
:effect (and (pred_1 ) (pred_5 ?v10 ?v9) (not (pred_2 ?v10)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_11 obj_03 obj_24 obj_23 obj_04 obj_10 obj_01 obj_19 obj_26 obj_13 obj_25 obj_12 obj_06 obj_17 obj_02 obj_29 obj_15 obj_28 obj_16 obj_21 obj_07 obj_05 obj_30 obj_18 obj_08
    obj_09 obj_20 obj_14
    obj_22 obj_27 obj_31
    )

    (:init
       (pred_1)

       (pred_3 obj_11)
       (pred_3 obj_03)
       (pred_3 obj_24)
       (pred_3 obj_23)
       (pred_3 obj_04)
       (pred_3 obj_10)
       (pred_3 obj_01)
       (pred_3 obj_19)
       (pred_3 obj_26)
       (pred_3 obj_13)
       (pred_3 obj_25)
       (pred_3 obj_12)
       (pred_3 obj_06)
       (pred_3 obj_17)
       (pred_3 obj_02)
       (pred_3 obj_29)
       (pred_3 obj_15)
       (pred_3 obj_28)
       (pred_3 obj_16)
       (pred_3 obj_21)
       (pred_3 obj_07)
       (pred_3 obj_05)
       (pred_3 obj_30)
       (pred_3 obj_18)
       (pred_3 obj_08)
       (pred_7 obj_09)
       (pred_7 obj_20)
       (pred_7 obj_14)
       (pred_6 obj_22)
       (pred_6 obj_27)
       (pred_6 obj_31)

       (pred_8 obj_11 obj_10)
       (pred_8 obj_11 obj_03)
       (pred_8 obj_03 obj_01)
       (pred_8 obj_03 obj_24)
       (pred_8 obj_03 obj_11)
       (pred_8 obj_24 obj_19)
       (pred_8 obj_24 obj_23)
       (pred_8 obj_24 obj_03)
       (pred_8 obj_23 obj_26)
       (pred_8 obj_23 obj_04)
       (pred_8 obj_23 obj_24)
       (pred_8 obj_04 obj_13)
       (pred_8 obj_04 obj_23)
       (pred_8 obj_10 obj_25)
       (pred_8 obj_10 obj_01)
       (pred_8 obj_10 obj_11)
       (pred_8 obj_01 obj_12)
       (pred_8 obj_01 obj_19)
       (pred_8 obj_01 obj_03)
       (pred_8 obj_01 obj_10)
       (pred_8 obj_19 obj_06)
       (pred_8 obj_19 obj_26)
       (pred_8 obj_19 obj_24)
       (pred_8 obj_19 obj_01)
       (pred_8 obj_26 obj_17)
       (pred_8 obj_26 obj_13)
       (pred_8 obj_26 obj_23)
       (pred_8 obj_26 obj_19)
       (pred_8 obj_13 obj_02)
       (pred_8 obj_13 obj_04)
       (pred_8 obj_13 obj_26)
       (pred_8 obj_25 obj_29)
       (pred_8 obj_25 obj_12)
       (pred_8 obj_25 obj_10)
       (pred_8 obj_12 obj_15)
       (pred_8 obj_12 obj_06)
       (pred_8 obj_12 obj_01)
       (pred_8 obj_12 obj_25)
       (pred_8 obj_06 obj_28)
       (pred_8 obj_06 obj_17)
       (pred_8 obj_06 obj_19)
       (pred_8 obj_06 obj_12)
       (pred_8 obj_17 obj_16)
       (pred_8 obj_17 obj_02)
       (pred_8 obj_17 obj_26)
       (pred_8 obj_17 obj_06)
       (pred_8 obj_02 obj_21)
       (pred_8 obj_02 obj_13)
       (pred_8 obj_02 obj_17)
       (pred_8 obj_29 obj_07)
       (pred_8 obj_29 obj_15)
       (pred_8 obj_29 obj_25)
       (pred_8 obj_15 obj_05)
       (pred_8 obj_15 obj_28)
       (pred_8 obj_15 obj_12)
       (pred_8 obj_15 obj_29)
       (pred_8 obj_28 obj_30)
       (pred_8 obj_28 obj_16)
       (pred_8 obj_28 obj_06)
       (pred_8 obj_28 obj_15)
       (pred_8 obj_16 obj_18)
       (pred_8 obj_16 obj_21)
       (pred_8 obj_16 obj_17)
       (pred_8 obj_16 obj_28)
       (pred_8 obj_21 obj_08)
       (pred_8 obj_21 obj_02)
       (pred_8 obj_21 obj_16)
       (pred_8 obj_07 obj_05)
       (pred_8 obj_07 obj_29)
       (pred_8 obj_05 obj_30)
       (pred_8 obj_05 obj_15)
       (pred_8 obj_05 obj_07)
       (pred_8 obj_30 obj_18)
       (pred_8 obj_30 obj_28)
       (pred_8 obj_30 obj_05)
       (pred_8 obj_18 obj_08)
       (pred_8 obj_18 obj_16)
       (pred_8 obj_18 obj_30)
       (pred_8 obj_08 obj_21)
       (pred_8 obj_08 obj_18)
       (pred_4 obj_19)
       (pred_4 obj_30)
       (pred_4 obj_12)
       (pred_10  obj_19 obj_09)
       (pred_10  obj_30 obj_20)
       (pred_10  obj_12 obj_14)
       (pred_12 obj_11)
       (pred_12 obj_03)
       (pred_12 obj_24)
       (pred_12 obj_23)
       (pred_12 obj_04)
       (pred_12 obj_10)
       (pred_12 obj_01)
       (pred_12 obj_26)
       (pred_12 obj_13)
       (pred_12 obj_25)
       (pred_12 obj_06)
       (pred_12 obj_17)
       (pred_12 obj_02)
       (pred_12 obj_29)
       (pred_12 obj_15)
       (pred_12 obj_28)
       (pred_12 obj_16)
       (pred_12 obj_21)
       (pred_12 obj_07)
       (pred_12 obj_05)
       (pred_12 obj_18)
       (pred_12 obj_08)

       (pred_11  obj_22 obj_09)
       (pred_11  obj_27 obj_20)
       (pred_11  obj_31 obj_14)
       (pred_5 obj_22 obj_21)
       (pred_5 obj_27 obj_17)
       (pred_5 obj_31 obj_15)
       (pred_9 obj_17)
    )

    (:goal (and
       (pred_5 obj_22 obj_13)
    ))
(:constraints
  (always (not (pred_9 obj_02)))
)
)

; plan
1. (op_2 obj_17 obj_16)
   deleted: (pred_9 obj_17)
   added: (pred_9 obj_16)
   goals met: 0 of 1
2. (op_2 obj_16 obj_21)
   deleted: (pred_9 obj_16)
   added: (pred_9 obj_21)
   goals met: 0 of 1
3. (op_3 obj_21 obj_22)
   deleted: (pred_5 obj_22 obj_21) (pred_1)
   added: (pred_2 obj_22)
   goals met: 0 of 1
4. (op_2 obj_21 obj_16)
   deleted: (pred_9 obj_21)
   added: (pred_9 obj_16)
   goals met: 0 of 1
5. (op_2 obj_16 obj_17)
   deleted: (pred_9 obj_16)
   added: (pred_9 obj_17)
   goals met: 0 of 1
6. (op_2 obj_17 obj_26)
   deleted: (pred_9 obj_17)
   added: (pred_9 obj_26)
   goals met: 0 of 1
7. (op_2 obj_26 obj_13)
   deleted: (pred_9 obj_26)
   added: (pred_9 obj_13)
   goals met: 0 of 1
8. (op_1 obj_13 obj_22)
   deleted: (pred_2 obj_22)
   added: (pred_1) (pred_5 obj_22 obj_13)
   goals met: 1 of 1
